maxgerhardt/micropython/ports/ch32/machine_spi.c
/* Hardware SPI for the CH32H417.
 *
 * The peripheral is the familiar STM32 one -- CTLR1/CTLR2, a status register
 * (STATR here, not SR), one DATAR shared by transmit and receive. There is no
 * FIFO: every write is answered by exactly one read, and the received byte must
 * be collected before the next one arrives or OVR is set and the data is lost.
 *
 * Transfers therefore go through DMA, not through a polling loop. That is not
 * an optimisation, it is what the peripheral needs to run at its own clock: at
 * HCLK/2 a byte is 160 ns, and a single register access across the bus matrix
 * costs around 200 ns, so no loop the CPU can run keeps up. Measured on this
 * board, polling topped out at 1.59 MB/s writing and 0.57 MB/s full duplex,
 * whatever the prescaler said, and full duplex above 6.25 MHz lost bytes
 * outright. DMA holds 99% of the line rate at every prescaler, 6.2 MB/s at
 * 50 MHz. See "SPI throughput" in docs/hw/ch32h417-notes.md for the figures.
 *
 * Chip select is deliberately not handled. Hardware NSS ties one bus to one
 * device and gets in the way the moment there are two, so MicroPython's
 * convention everywhere is that the caller drives CS with an ordinary Pin. The
 * peripheral runs with software slave management (SSM=1, SSI=1), which is also
 * what keeps a master out of mode-fault when NSS floats.
 *
 * Alternate-function numbers differ per pin, not just per peripheral, so each
 * table below carries the AF alongside the pin.
 */
#include "ch32h417.h"

#include "py/mperrno.h"
#include "py/mphal.h"
#include "py/runtime.h"
#include "extmod/modmachine.h"

#include "machine_pin.h"
#include "irq.h"

#define SPI_DEFAULT_BAUDRATE  (1000000)
#define SPI_DEFAULT_POLARITY  (0)
#define SPI_DEFAULT_PHASE     (0)
#define SPI_DEFAULT_BITS      (8)
#define SPI_DEFAULT_FIRSTBIT  (MICROPY_PY_MACHINE_SPI_MSB)

/* One byte at the slowest possible clock (HCLK/256, so ~390 kHz) takes about
 * 21 us. This is three orders of magnitude above that: it is here to turn a
 * wedged peripheral into an exception instead of a hang, not to police
 * timing. Both waits below restart it whenever a byte moves, so it bounds the
 * gap between bytes rather than the length of a transfer. */
#define SPI_TIMEOUT_US        (20000)

/* Two DMA channels serve all four buses. A machine.SPI transfer is synchronous
 * and this port has no threads, so only one can ever be in flight. Channels 2
 * and 3 are the pair WCH's own SPI_DMA example uses. */
#define SPI_DMA_RX            (DMA1_Channel2)
#define SPI_DMA_TX            (DMA1_Channel3)
#define SPI_DMA_RX_MUX        (DMA_MuxChannel2)
#define SPI_DMA_TX_MUX        (DMA_MuxChannel3)
#define SPI_DMA_RX_IRQN       (DMA1_Channel2_IRQn)
#define SPI_DMA_TX_IRQN       (DMA1_Channel3_IRQn)
/* INTFR/INTFCR give each channel a nibble: global, complete, half, error. */
#define SPI_DMA_RX_FLAGS      ((uint32_t)0x000000F0)
#define SPI_DMA_TX_FLAGS      ((uint32_t)0x00000F00)

/* Reference manual table 10-2: SPIn_TX is DMA request 61 + 2n and SPIn_RX is
 * 62 + 2n, so 63 and 64 for SPI1. WCH's example asks for 65 and 66 on SPI2,
 * which agrees. */
#define SPI_DMA_TX_REQ(id)    (61 + 2 * (id))
#define SPI_DMA_RX_REQ(id)    (62 + 2 * (id))

/* CNTR is 16 bits, so a longer buffer goes out in several passes. */
#define SPI_DMA_MAX_LEN       (65535)

/* Below this a write is quicker to push out by hand than to set two channels up
 * for. Setting them up costs about 3 us, so at HCLK/2 -- where DMA saves the
 * most per byte -- the two paths cost the same at around ten bytes, and at
 * HCLK/8 and slower polling already keeps SCK busy and DMA can only lose. Set a
 * little above the crossover so that short register traffic, which is most of
 * what a write is used for, stays on the cheap path at every baudrate. */
#define SPI_DMA_MIN_LEN       (16)

typedef struct _machine_spi_obj_t {
    mp_obj_base_t base;
    SPI_TypeDef *spi;
    uint8_t id;
    uint8_t sck;                      /* pin ids, as machine_pin.h encodes them */
    uint8_t miso;
    uint8_t mosi;
    uint8_t polarity;
    uint8_t phase;
    uint8_t firstbit;
    uint8_t prescaler_log2;           /* SCK = HCLK >> (prescaler_log2 + 1) */
    uint32_t baudrate;                /* the rate actually achieved */
    /* In-flight interrupt-driven transfer. Only meaningful while this object
     * is the one machine_spi_async points at. */
    const uint8_t *xfer_src;
    uint8_t *xfer_dest;
    size_t xfer_left;
    uint16_t xfer_chunk;
} machine_spi_obj_t;

/* Which pins each signal can come out on, and with which alternate function.
 *
 * Kept as three independent tables rather than fixed triples because the mux
 * combines them freely: any SCK option for a bus works with any MISO and MOSI
 * option for that bus. The first entry for a bus is its default.
 *
 * Domain note, the same one that applies to I2C: SPI1 on PA5/PA6/PA7 and SPI4
 * on PE2/PE5/PE6 sit in the 3.3 V supply domains. Most of the rest is on
 * VIO18, which comes up well below 3.3 V, so a 3.3 V peripheral wired straight
 * to those pins needs level shifting. The datasheet distinguishes the domains
 * only by colour in the package figure, so this came from measurement: driving
 * PA5, PA6 and PA7 high and reading each back through the ADC gives 3.299 V.
 *
 * Some entries collide with functions this board already uses -- SPI2_SCK on
 * PA9 is the REPL's UART TX, on PA12 it is USB D+ -- so they are listed last
 * and are only ever selected if the caller asks for them by name. */
typedef struct _machine_spi_pin_t {
    uint8_t id;
    uint8_t pin;
    uint8_t af;
} machine_spi_pin_t;

#define PIN_ID(port, num) (((port) << 4) | (num))
#define PORT_A (0)
#define PORT_B (1)
#define PORT_C (2)
#define PORT_D (3)
#define PORT_E (4)
#define PORT_F (5)

static const machine_spi_pin_t machine_spi_sck_options[] = {
    { 1, PIN_ID(PORT_A, 5),  5 },   /* 3.3 V domain */
    { 1, PIN_ID(PORT_B, 3),  5 },
    { 1, PIN_ID(PORT_F, 5),  5 },
    { 1, PIN_ID(PORT_F, 7),  3 },
    { 2, PIN_ID(PORT_B, 13), 5 },
    { 2, PIN_ID(PORT_B, 10), 5 },
    { 2, PIN_ID(PORT_C, 2),  5 },
    { 2, PIN_ID(PORT_D, 3),  5 },
    { 2, PIN_ID(PORT_E, 14), 5 },
    { 2, PIN_ID(PORT_A, 9),  5 },   /* also USART1 TX */
    { 2, PIN_ID(PORT_A, 12), 5 },   /* also USB D+ */
    { 3, PIN_ID(PORT_B, 3),  6 },
    { 3, PIN_ID(PORT_C, 10), 6 },
    { 3, PIN_ID(PORT_A, 14), 1 },
    { 4, PIN_ID(PORT_E, 2),  5 },   /* 3.3 V domain */
    { 4, PIN_ID(PORT_E, 12), 5 },
};

static const machine_spi_pin_t machine_spi_miso_options[] = {
    { 1, PIN_ID(PORT_A, 6),  5 },   /* 3.3 V domain */
    { 1, PIN_ID(PORT_B, 4),  5 },
    { 1, PIN_ID(PORT_F, 3),  5 },
    { 1, PIN_ID(PORT_F, 9),  3 },
    { 2, PIN_ID(PORT_B, 14), 5 },
    { 2, PIN_ID(PORT_C, 2),  5 },
    { 3, PIN_ID(PORT_C, 11), 6 },
    { 3, PIN_ID(PORT_B, 4),  6 },
    { 3, PIN_ID(PORT_C, 9),  5 },
    { 4, PIN_ID(PORT_E, 5),  5 },   /* 3.3 V domain */
    { 4, PIN_ID(PORT_E, 13), 5 },
};

static const machine_spi_pin_t machine_spi_mosi_options[] = {
    { 1, PIN_ID(PORT_A, 7),  5 },   /* 3.3 V domain */
    { 1, PIN_ID(PORT_B, 5),  5 },
    { 1, PIN_ID(PORT_D, 7),  5 },
    { 1, PIN_ID(PORT_F, 8),  3 },
    { 2, PIN_ID(PORT_B, 15), 5 },
    { 2, PIN_ID(PORT_C, 3),  5 },
    { 2, PIN_ID(PORT_C, 1),  5 },
    { 3, PIN_ID(PORT_C, 12), 6 },
    { 3, PIN_ID(PORT_B, 5),  7 },
    { 3, PIN_ID(PORT_B, 2),  7 },
    { 3, PIN_ID(PORT_D, 6),  5 },
    { 3, PIN_ID(PORT_A, 13), 1 },
    { 4, PIN_ID(PORT_E, 6),  5 },   /* 3.3 V domain */
    { 4, PIN_ID(PORT_E, 14), 5 },
};

static machine_spi_obj_t machine_spi_obj[4];

static SPI_TypeDef *const machine_spi_regs[4] = { SPI1, SPI2, SPI3, SPI4 };

