maxgerhardt/micropython/ports/ch32/machine_spi.c
void CH32_IRQ_HANDLER(DMA1_Channel2_IRQHandler);
void DMA1_Channel2_IRQHandler(void) {
    SPI_DMA_RX->CFGR &= ~DMA_IT_TC;
    DMA1->INTFCR = SPI_DMA_RX_FLAGS;
    machine_spi_dma_complete();
}

void CH32_IRQ_HANDLER(DMA1_Channel3_IRQHandler);
void DMA1_Channel3_IRQHandler(void) {
    SPI_DMA_TX->CFGR &= ~DMA_IT_TC;
    DMA1->INTFCR = SPI_DMA_TX_FLAGS;
    machine_spi_dma_complete();
}

/* Sleep until `ch` has moved every byte. Returns false on timeout. */
static bool machine_spi_dma_wait(DMA_Channel_TypeDef *ch) {
    uint32_t left = ch->CNTR;
    uint64_t deadline = mp_hal_ticks_us() + SPI_TIMEOUT_US;
    while (ch->CNTR != 0) {
        /* Gate the core clock rather than spin on CNTR: the transfer is the
         * DMA's work, not the CPU's, and at 390 kHz a full buffer is over a
         * second of otherwise wasted power.
         *
         * There is no wait-for-event race to lose here. The handler above has
         * already disabled its interrupt by the time CNTR reads zero, so a
         * completion that beats us to the test leaves the loop instead of
         * sleeping through it; and a WFI that does sleep is bounded by
         * SysTick's 1 ms tick regardless. */
        __WFI();
        uint32_t now = ch->CNTR;
        if (now != left) {
            left = now;
            deadline = mp_hal_ticks_us() + SPI_TIMEOUT_US;
        } else if (mp_hal_ticks_us() > deadline) {
            return false;
        }
    }
    return true;
}

/* Returns false on timeout rather than raising, because the caller has DMA
 * channels and peripheral request lines to switch off first: raising from here
 * would leave a channel armed and writing into a buffer the GC is free to
 * reuse. */
/* Clocks, request routing and interrupts: the parts of a DMA transfer that do
 * not change between chunks, and that both the blocking and the
 * interrupt-driven path need before arming anything. */
static void machine_spi_dma_prepare(machine_spi_obj_t *self) {
    RCC_HBPeriphClockCmd(RCC_HBPeriph_DMA1, ENABLE);
    DMA_MuxChannelConfig(SPI_DMA_TX_MUX, SPI_DMA_TX_REQ(self->id));
    DMA_MuxChannelConfig(SPI_DMA_RX_MUX, SPI_DMA_RX_REQ(self->id));
    NVIC_EnableIRQ(SPI_DMA_TX_IRQN);
    NVIC_EnableIRQ(SPI_DMA_RX_IRQN);
}

/* Stop both channels and drop the request lines. Safe to call on a transfer
 * that never started, which is what makes it usable as an abort. */
static void machine_spi_dma_disarm(machine_spi_obj_t *self) {
    SPI_I2S_DMACmd(self->spi, SPI_I2S_DMAReq_Tx, DISABLE);
    SPI_I2S_DMACmd(self->spi, SPI_I2S_DMAReq_Rx, DISABLE);
    DMA_ITConfig(SPI_DMA_TX, DMA_IT_TC, DISABLE);
    DMA_ITConfig(SPI_DMA_RX, DMA_IT_TC, DISABLE);
    DMA_Cmd(SPI_DMA_TX, DISABLE);
    DMA_Cmd(SPI_DMA_RX, DISABLE);
}

/* Arm and start one chunk of up to SPI_DMA_MAX_LEN bytes, returning the
 * channel whose transfer-complete ends it. */
static DMA_Channel_TypeDef *machine_spi_dma_arm(machine_spi_obj_t *self, uint16_t n,
    const uint8_t *src, uint8_t *dest) {
    SPI_TypeDef *spi = self->spi;
    {
        DMA_Cmd(SPI_DMA_TX, DISABLE);
        DMA_Cmd(SPI_DMA_RX, DISABLE);
        DMA1->INTFCR = SPI_DMA_TX_FLAGS | SPI_DMA_RX_FLAGS;

        /* Every field this leaves zero is already the wanted default: single
         * buffer, normal (non-circular) mode, byte to byte, not memory to
         * memory. DATAR does not move, so the peripheral address never
         * increments either. */
        DMA_InitTypeDef init = {0};
        init.DMA_PeripheralBaseAddr = (uint32_t)&spi->DATAR;
        init.DMA_PeripheralInc = DMA_PeripheralInc_Disable;
        init.DMA_BufferSize = n;

        if (dest != NULL) {
            /* Receive outranks transmit: a byte collected late is lost, while a
             * byte loaded late only leaves SCK idle for a moment. */
            init.DMA_DIR = DMA_DIR_PeripheralSRC;
            init.DMA_Memory0BaseAddr = (uint32_t)dest;
            init.DMA_MemoryInc = DMA_MemoryInc_Enable;
            init.DMA_Priority = DMA_Priority_VeryHigh;
            DMA_Init(SPI_DMA_RX, &init);
        }

        /* read() and readinto() hand the same buffer in as both source and
         * destination. That is safe without a copy: a byte has to be loaded
         * into DATAR before it can be shifted out, and the byte it exchanges
         * only lands two byte-times later, so the transmit side is always at
         * least two positions ahead of the receive side overwriting it. */
        init.DMA_DIR = DMA_DIR_PeripheralDST;
        init.DMA_Memory0BaseAddr = src != NULL
            ? (uint32_t)src : (uint32_t)&machine_spi_idle_byte;
        init.DMA_MemoryInc = src != NULL
            ? DMA_MemoryInc_Enable : DMA_MemoryInc_Disable;
        init.DMA_Priority = DMA_Priority_High;
        DMA_Init(SPI_DMA_TX, &init);

        machine_spi_drain(spi);

        /* Arm the receiver before anything can be received. WCH's example
         * enables the transmit side first, which at these clocks is a byte
         * lost: the first one can complete before the receive channel is
         * listening. */
        DMA_Channel_TypeDef *watch = SPI_DMA_TX;
        if (dest != NULL) {
            /* A completion left pending in the NVIC by an abandoned transfer
             * would run the handler the moment this is enabled, clearing the
             * TCIE that has just been set. The transfer would still finish, but
             * nothing would wake the wait, so it would crawl at SysTick's 1 ms
             * instead of ending when the last byte lands. */
            NVIC_ClearPendingIRQ(SPI_DMA_RX_IRQN);
            DMA_ITConfig(SPI_DMA_RX, DMA_IT_TC, ENABLE);
            DMA_Cmd(SPI_DMA_RX, ENABLE);
            SPI_I2S_DMACmd(spi, SPI_I2S_DMAReq_Rx, ENABLE);
            watch = SPI_DMA_RX;
        } else {
            NVIC_ClearPendingIRQ(SPI_DMA_TX_IRQN);
            DMA_ITConfig(SPI_DMA_TX, DMA_IT_TC, ENABLE);
        }
        SPI_I2S_DMACmd(spi, SPI_I2S_DMAReq_Tx, ENABLE);
        DMA_Cmd(SPI_DMA_TX, ENABLE);
        return watch;
    }
}

static bool machine_spi_transfer_dma(machine_spi_obj_t *self, size_t len,
    const uint8_t *src, uint8_t *dest) {
    bool ok = true;

    machine_spi_dma_prepare(self);
    while (len != 0 && ok) {
        uint16_t n = len > SPI_DMA_MAX_LEN ? SPI_DMA_MAX_LEN : (uint16_t)len;
        ok = machine_spi_dma_wait(machine_spi_dma_arm(self, n, src, dest));
        machine_spi_dma_disarm(self);
        len -= n;
        if (src != NULL) {
            src += n;
        }
        if (dest != NULL) {
            dest += n;
        }
    }
    return ok;
}

/* --- interrupt-driven transfers ---
 *
 * machine.I2S sets the pattern, and this follows it rather than inventing
 * anything: irq() takes a callback, and with one set the ordinary write(),
 * readinto() and write_readinto() calls start the transfer and return
 * immediately, with the callback run once it has finished. extmod's I2S header
 * spells out that the mode is chosen by setting a callback and that the
 * asynchronous half is the port's business, which is what this is.
 *
 * Two things the caller owns. The buffers must stay referenced until the
 * callback arrives -- the DMA is reading and writing them the whole time, and
 * nothing here can keep them alive. And only one transfer can be in flight,
 * because there is one pair of DMA channels; a second one raises EBUSY rather
 * than queueing, so an overlap is a mistake the program can see.
 */
static machine_spi_obj_t *machine_spi_async;

/* The irq() handler, kept in a root pointer rather than in the object: the SPI
 * objects are static, so the collector never traces them and a callback stored
 * there would be collected while still in use. */
#define machine_spi_handler(self) (MP_STATE_PORT(machine_spi_irq_handler)[(self)->id - 1])

static void machine_spi_async_arm(machine_spi_obj_t *self) {
    uint16_t n = self->xfer_left > SPI_DMA_MAX_LEN
        ? SPI_DMA_MAX_LEN : (uint16_t)self->xfer_left;
    self->xfer_chunk = n;
    machine_spi_dma_arm(self, n, self->xfer_src, self->xfer_dest);
}

static void machine_spi_dma_complete(void) {
    machine_spi_obj_t *self = machine_spi_async;
    if (self == NULL) {
        /* A blocking transfer, or one already finished: the handler above has
         * cleared the flag and there is nothing else to do. */
        return;
    }

    machine_spi_dma_disarm(self);
    self->xfer_left -= self->xfer_chunk;
    if (self->xfer_src != NULL) {
        self->xfer_src += self->xfer_chunk;
    }
    if (self->xfer_dest != NULL) {
        self->xfer_dest += self->xfer_chunk;
    }
    if (self->xfer_left != 0) {
        machine_spi_async_arm(self);
        return;
    }

    /* On a write with nothing to receive the transmit channel is what was
     * watched, and it reports done when the last byte reaches DATAR rather
     * than when it leaves the pin. Waiting for BSY here keeps the callback
     * from running while SCK is still moving, which would let it raise CS
     * mid-byte. The bound matters because this is interrupt context: at any
     * baud rate worth using DMA for this is under a microsecond, and a bus
     * that has genuinely stopped responding must not hold the core. */
    for (uint32_t i = 0; i < 1000 && (self->spi->STATR & SPI_STATR_BSY); i++) {
    }

    machine_spi_async = NULL;
    mp_obj_t handler = machine_spi_handler(self);
    if (handler != MP_OBJ_NULL) {
        mp_sched_schedule(handler, MP_OBJ_FROM_PTR(self));
    }
}

