maxgerhardt/micropython/ports/ch32/machine_spi.c
/* Abandon an interrupt-driven transfer, from the soft-reset path.
 *
 * The DMA is writing into a Python buffer, and a soft reset hands that memory
 * back to a heap that is about to be rebuilt; a channel left running would
 * scribble over whatever the next program allocates there. The root pointer
 * goes too, for the reason machine_i2s_deinit_all() documents: mp_init() does
 * not clear them, so it would otherwise dangle into the discarded heap. */
void machine_spi_deinit_all(void) {
    if (machine_spi_async != NULL) {
        machine_spi_dma_disarm(machine_spi_async);
        machine_spi_async = NULL;
    }
    for (size_t i = 0; i < MP_ARRAY_SIZE(machine_spi_obj); i++) {
        MP_STATE_PORT(machine_spi_irq_handler)[i] = MP_OBJ_NULL;
    }
}

/* Write-only, and short enough that setting two DMA channels up would cost more
 * than the bytes do. Nothing is going to look at what came back, so let the
 * receive buffer overrun: OVR stops the receive path updating but transmission
 * carries on, and machine_spi_drain() clears it before the next transfer. */
static bool machine_spi_transfer_polled(machine_spi_obj_t *self, size_t len,
    const uint8_t *src) {
    for (size_t i = 0; i < len; i++) {
        if (machine_spi_wait(self, SPI_STATR_TXE) != 0) {
            return false;
        }
        self->spi->DATAR = src != NULL ? src[i] : 0;
    }
    return true;
}

static void machine_spi_transfer(mp_obj_base_t *self_in, size_t len,
    const uint8_t *src, uint8_t *dest) {
    machine_spi_obj_t *self = (machine_spi_obj_t *)self_in;
    SPI_TypeDef *spi = self->spi;

    if (len == 0) {
        return;
    }

    /* With a callback set, start the transfer and leave. */
    if (machine_spi_handler(self) != MP_OBJ_NULL) {
        if (machine_spi_async != NULL) {
            mp_raise_OSError(MP_EBUSY);
        }
        self->xfer_src = src;
        self->xfer_dest = dest;
        self->xfer_left = len;
        machine_spi_async = self;
        machine_spi_dma_prepare(self);
        machine_spi_drain(spi);
        machine_spi_async_arm(self);
        return;
    }

    /* Anything that has to be received goes through DMA however short it is.
     * The alternative would be a length at which a read starts working, which
     * is the worst kind of limit to document: polling cannot collect bytes at
     * the top of this peripheral's range at any length. Writes have no such
     * constraint -- an overrun costs a write nothing -- so short ones take the
     * cheaper path. The crossover was measured at about 24 bytes. */
    bool ok;
    if (dest != NULL || len >= SPI_DMA_MIN_LEN) {
        ok = machine_spi_transfer_dma(self, len, src, dest);
    } else {
        machine_spi_drain(spi);
        ok = machine_spi_transfer_polled(self, len, src);
    }

    /* Do not return while SCK is still moving: the caller's next act is
     * usually to raise CS, and doing that mid-byte truncates the frame. The
     * transmit DMA finishes one byte early for the same reason -- its last
     * write only reaches DATAR, not the wire. */
    uint64_t deadline = mp_hal_ticks_us() + SPI_TIMEOUT_US;
    while (ok && (spi->STATR & SPI_STATR_BSY)) {
        if (mp_hal_ticks_us() > deadline) {
            ok = false;
        }
    }

    if (!ok) {
        mp_raise_OSError(MP_ETIMEDOUT);
    }
}

static void machine_spi_print(const mp_print_t *print, mp_obj_t self_in, mp_print_kind_t kind) {
    (void)kind;
    machine_spi_obj_t *self = MP_OBJ_TO_PTR(self_in);
    mp_printf(print,
        "SPI(%u, baudrate=%u, polarity=%u, phase=%u, bits=8, firstbit=%u, "
        "sck=P%c%u, mosi=P%c%u, miso=P%c%u)",
        self->id, self->baudrate, self->polarity, self->phase, self->firstbit,
        'A' + MACHINE_PIN_PORT(self->sck), MACHINE_PIN_NUM(self->sck),
        'A' + MACHINE_PIN_PORT(self->mosi), MACHINE_PIN_NUM(self->mosi),
        'A' + MACHINE_PIN_PORT(self->miso), MACHINE_PIN_NUM(self->miso));
}

/* Resolve one signal: the caller's pin if they named one and the mux can
 * produce it, otherwise the bus default. Returns the table entry so the caller
 * gets the alternate-function number with it. */
static const machine_spi_pin_t *machine_spi_find_pin(const machine_spi_pin_t *options,
    size_t n_options, uint8_t id, mp_obj_t requested, qstr what) {
    for (size_t i = 0; i < n_options; i++) {
        if (options[i].id != id) {
            continue;
        }
        if (requested == mp_const_none || machine_pin_get(requested)->id == options[i].pin) {
            return &options[i];
        }
    }
    mp_raise_msg_varg(&mp_type_ValueError,
        MP_ERROR_TEXT("SPI(%u) has no %q on that pin"), id, what);
}

static void machine_spi_configure(machine_spi_obj_t *self, size_t n_args,
    const mp_obj_t *pos_args, mp_map_t *kw_args, bool is_new) {
    enum { ARG_baudrate, ARG_polarity, ARG_phase, ARG_bits, ARG_firstbit,
           ARG_sck, ARG_mosi, ARG_miso };
    static const mp_arg_t allowed_args[] = {
        { MP_QSTR_baudrate, MP_ARG_INT, {.u_int = -1} },
        { MP_QSTR_polarity, MP_ARG_INT, {.u_int = -1} },
        { MP_QSTR_phase,    MP_ARG_INT, {.u_int = -1} },
        { MP_QSTR_bits,     MP_ARG_INT, {.u_int = -1} },
        { MP_QSTR_firstbit, MP_ARG_INT, {.u_int = -1} },
        { MP_QSTR_sck,      MP_ARG_KW_ONLY | MP_ARG_OBJ, {.u_rom_obj = MP_ROM_NONE} },
        { MP_QSTR_mosi,     MP_ARG_KW_ONLY | MP_ARG_OBJ, {.u_rom_obj = MP_ROM_NONE} },
        { MP_QSTR_miso,     MP_ARG_KW_ONLY | MP_ARG_OBJ, {.u_rom_obj = MP_ROM_NONE} },
    };
    mp_arg_val_t args[MP_ARRAY_SIZE(allowed_args)];
    mp_arg_parse_all(n_args, pos_args, kw_args,
        MP_ARRAY_SIZE(allowed_args), allowed_args, args);

    /* -1 means "not given". On a fresh object that becomes the default; on
     * init() it means "leave this setting alone", which is what lets
     * spi.init(baudrate=...) keep the pins and mode already in use. */
    uint32_t baudrate = SPI_DEFAULT_BAUDRATE;
    if (args[ARG_baudrate].u_int >= 0) {
        baudrate = args[ARG_baudrate].u_int;
    } else if (!is_new) {
        baudrate = self->baudrate;
    }
    if (baudrate == 0) {
        mp_raise_ValueError(MP_ERROR_TEXT("baudrate must be positive"));
    }

    if (args[ARG_bits].u_int >= 0 && args[ARG_bits].u_int != 8) {
        /* The peripheral can do 16, but only as whole 16-bit words with a
         * byte order the buffer protocol does not describe, so exposing it
         * would be a trap rather than a feature. */
        mp_raise_ValueError(MP_ERROR_TEXT("only bits=8 is supported"));
    }

    if (args[ARG_polarity].u_int >= 0) {
        self->polarity = args[ARG_polarity].u_int ? 1 : 0;
    } else if (is_new) {
        self->polarity = SPI_DEFAULT_POLARITY;
    }
    if (args[ARG_phase].u_int >= 0) {
        self->phase = args[ARG_phase].u_int ? 1 : 0;
    } else if (is_new) {
        self->phase = SPI_DEFAULT_PHASE;
    }
    if (args[ARG_firstbit].u_int >= 0) {
        self->firstbit = args[ARG_firstbit].u_int ? MICROPY_PY_MACHINE_SPI_LSB
            : MICROPY_PY_MACHINE_SPI_MSB;
    } else if (is_new) {
        self->firstbit = SPI_DEFAULT_FIRSTBIT;
    }

    bool pins_given = args[ARG_sck].u_obj != mp_const_none
        || args[ARG_mosi].u_obj != mp_const_none
        || args[ARG_miso].u_obj != mp_const_none;

