maxgerhardt/micropython/ports/ch32/machine_spi.c
    if (is_new || pins_given) {
        const machine_spi_pin_t *sck = machine_spi_find_pin(machine_spi_sck_options,
            MP_ARRAY_SIZE(machine_spi_sck_options), self->id, args[ARG_sck].u_obj, MP_QSTR_sck);
        const machine_spi_pin_t *miso = machine_spi_find_pin(machine_spi_miso_options,
            MP_ARRAY_SIZE(machine_spi_miso_options), self->id, args[ARG_miso].u_obj, MP_QSTR_miso);
        const machine_spi_pin_t *mosi = machine_spi_find_pin(machine_spi_mosi_options,
            MP_ARRAY_SIZE(machine_spi_mosi_options), self->id, args[ARG_mosi].u_obj, MP_QSTR_mosi);

        self->sck = sck->pin;
        self->miso = miso->pin;
        self->mosi = mosi->pin;

        machine_spi_init_pin(sck->pin, sck->af);
        machine_spi_init_pin(miso->pin, miso->af);
        machine_spi_init_pin(mosi->pin, mosi->af);
    }

    uint32_t hclk = machine_spi_periph_clock();
    self->prescaler_log2 = machine_spi_prescaler_for(hclk, baudrate);
    self->baudrate = hclk >> (self->prescaler_log2 + 1);

    machine_spi_init_periph(self);
}

static mp_obj_t machine_spi_make_new(const mp_obj_type_t *type, size_t n_args,
    size_t n_kw, const mp_obj_t *all_args) {
    mp_arg_check_num(n_args, n_kw, 1, MP_OBJ_FUN_ARGS_MAX, true);

    mp_int_t id = mp_obj_get_int(all_args[0]);
    if (id < 1 || id > 4) {
        mp_raise_msg_varg(&mp_type_ValueError, MP_ERROR_TEXT("SPI(%d) does not exist"), id);
    }

    machine_spi_obj_t *self = &machine_spi_obj[id - 1];
    self->base.type = type;
    self->spi = machine_spi_regs[id - 1];
    self->id = (uint8_t)id;

    mp_map_t kw_args;
    mp_map_init_fixed_table(&kw_args, n_kw, all_args + n_args);
    machine_spi_configure(self, n_args - 1, all_args + 1, &kw_args, true);

    return MP_OBJ_FROM_PTR(self);
}

static void machine_spi_init(mp_obj_base_t *self_in, size_t n_args,
    const mp_obj_t *pos_args, mp_map_t *kw_args) {
    machine_spi_obj_t *self = (machine_spi_obj_t *)self_in;
    machine_spi_configure(self, n_args, pos_args, kw_args, false);
}

static void machine_spi_deinit(mp_obj_base_t *self_in) {
    machine_spi_obj_t *self = (machine_spi_obj_t *)self_in;
    /* Drop the request lines before the clock: a peripheral left asking for DMA
     * would drive whichever bus claimed those two channels next. */
    SPI_I2S_DMACmd(self->spi, SPI_I2S_DMAReq_Tx, DISABLE);
    SPI_I2S_DMACmd(self->spi, SPI_I2S_DMAReq_Rx, DISABLE);
    SPI_Cmd(self->spi, DISABLE);
    /* The pins keep their alternate function. Handing them back as inputs
     * would drop SCK and CS-adjacent lines to whatever the board pulls them
     * to, which is a worse default than leaving an idle bus idle. */
}

/* Set a callback and transfers become non-blocking; pass None and they go
 * back to blocking. Same call, same meaning, as machine.I2S.irq().
 *
 * The handler is called with the SPI object, from the scheduler rather than
 * from the interrupt itself, so it may allocate and raise like any other
 * Python code. Setting it to None while a transfer is running does not stop
 * that transfer -- it finishes, silently. */
static mp_obj_t machine_spi_irq(mp_obj_t self_in, mp_obj_t handler) {
    machine_spi_obj_t *self = MP_OBJ_TO_PTR(self_in);
    if (handler != mp_const_none && !mp_obj_is_callable(handler)) {
        mp_raise_ValueError(MP_ERROR_TEXT("invalid callback"));
    }
    machine_spi_handler(self) = (handler == mp_const_none) ? MP_OBJ_NULL : handler;
    return mp_const_none;
}
static MP_DEFINE_CONST_FUN_OBJ_2(machine_spi_irq_obj, machine_spi_irq);

/* init() and deinit() as methods. extmod keeps its own versions static, so a
 * port that wants to add anything to the dictionary has to supply these two
 * itself; they do nothing but call the protocol entries just above. */
static mp_obj_t machine_spi_init_meth(size_t n_args, const mp_obj_t *args, mp_map_t *kw_args) {
    machine_spi_init((mp_obj_base_t *)MP_OBJ_TO_PTR(args[0]), n_args - 1, args + 1, kw_args);
    return mp_const_none;
}
static MP_DEFINE_CONST_FUN_OBJ_KW(machine_spi_init_meth_obj, 1, machine_spi_init_meth);

static mp_obj_t machine_spi_deinit_meth(mp_obj_t self_in) {
    machine_spi_deinit((mp_obj_base_t *)MP_OBJ_TO_PTR(self_in));
    return mp_const_none;
}
static MP_DEFINE_CONST_FUN_OBJ_1(machine_spi_deinit_meth_obj, machine_spi_deinit_meth);

/* The generic dictionary, plus irq(). The transfer methods are extmod's own
 * objects, so read(), write() and friends behave exactly as they do on every
 * other port -- only the extra entry is this port's. */
static const mp_rom_map_elem_t machine_spi_locals_dict_table[] = {
    { MP_ROM_QSTR(MP_QSTR_init), MP_ROM_PTR(&machine_spi_init_meth_obj) },
    { MP_ROM_QSTR(MP_QSTR_deinit), MP_ROM_PTR(&machine_spi_deinit_meth_obj) },
    { MP_ROM_QSTR(MP_QSTR_read), MP_ROM_PTR(&mp_machine_spi_read_obj) },
    { MP_ROM_QSTR(MP_QSTR_readinto), MP_ROM_PTR(&mp_machine_spi_readinto_obj) },
    { MP_ROM_QSTR(MP_QSTR_write), MP_ROM_PTR(&mp_machine_spi_write_obj) },
    { MP_ROM_QSTR(MP_QSTR_write_readinto), MP_ROM_PTR(&mp_machine_spi_write_readinto_obj) },
    { MP_ROM_QSTR(MP_QSTR_irq), MP_ROM_PTR(&machine_spi_irq_obj) },

    { MP_ROM_QSTR(MP_QSTR_MSB), MP_ROM_INT(MICROPY_PY_MACHINE_SPI_MSB) },
    { MP_ROM_QSTR(MP_QSTR_LSB), MP_ROM_INT(MICROPY_PY_MACHINE_SPI_LSB) },
};
static MP_DEFINE_CONST_DICT(machine_spi_locals_dict, machine_spi_locals_dict_table);

static const mp_machine_spi_p_t machine_spi_p = {
    .init = machine_spi_init,
    .deinit = machine_spi_deinit,
    .transfer = machine_spi_transfer,
};

MP_DEFINE_CONST_OBJ_TYPE(
    machine_spi_type,
    MP_QSTR_SPI,
    MP_TYPE_FLAG_NONE,
    make_new, machine_spi_make_new,
    print, machine_spi_print,
    protocol, &machine_spi_p,
    locals_dict, &machine_spi_locals_dict
    );

MP_REGISTER_ROOT_POINTER(mp_obj_t machine_spi_irq_handler[4]);
